In [105]:
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in c:\users\user\appdata\roaming\python\python310\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\user\appdata\roaming\python\python310\site-packages (from mysql-connector-python) (3.20.3)

<h4>Question 1</h4>

In [155]:
#importing the libraries
import pandas as pd

In [22]:
# Create a dictionary with the column names as keys and data as values
data = {
    'employee_name': ["Abel", "Mesfin", "Tesfaw","Iwunete","Kefale","Palit","Kabede","Ashebir","Melkamu","Bethelehem","Gessese","Melat"],
    'department': ["Sales", "Sales", "Sales","Finance","Finance","Finance","Finance","Marketing","Marketing","Sales","Finance","Sales"],
    'state': ["Dire Dawa", "Dire Dawa", "Gondar","Jijiga","Gondar","Dire Dawa","Gondar","Jijiga","Gondar","Adama","Dire Dawa","Adama"],
    'salary': [90000,86000,81000,90000,99000,83000,79000,80000,91000,4000,7000,78000],
    'age': [34,56,30,49,40,36,53,65,50,26,43,39],
    'bonus': [10000,20000,23000,23000,24000,19000,15000,18000,21000,14000,12000,31000],
}

# Create the DataFrame from the dictionary
df = pd.DataFrame(data)

In [23]:
#check the dataframe
df.head(5)

  employee_name department      state  salary  age  bonus
0          Abel      Sales  Dire Dawa   90000   34  10000
1        Mesfin      Sales  Dire Dawa   86000   56  20000
2        Tesfaw      Sales     Gondar   81000   30  23000
3       Iwunete    Finance     Jijiga   90000   49  23000
4        Kefale    Finance     Gondar   99000   40  24000

In [24]:
#Check the data types
df.dtypes

employee_name    object
department       object
state            object
salary            int64
age               int64
bonus             int64
dtype: object

<p>Answer: Displaying as a dictionary</p>

In [25]:
print(data)

{'employee_name': ['Abel', 'Mesfin', 'Tesfaw', 'Iwunete', 'Kefale', 'Palit', 'Kabede', 'Ashebir', 'Melkamu', 'Bethelehem', 'Gessese', 'Melat'], 'department': ['Sales', 'Sales', 'Sales', 'Finance', 'Finance', 'Finance', 'Finance', 'Marketing', 'Marketing', 'Sales', 'Finance', 'Sales'], 'state': ['Dire Dawa', 'Dire Dawa', 'Gondar', 'Jijiga', 'Gondar', 'Dire Dawa', 'Gondar', 'Jijiga', 'Gondar', 'Adama', 'Dire Dawa', 'Adama'], 'salary': [90000, 86000, 81000, 90000, 99000, 83000, 79000, 80000, 91000, 4000, 7000, 78000], 'age': [34, 56, 30, 49, 40, 36, 53, 65, 50, 26, 43, 39], 'bonus': [10000, 20000, 23000, 23000, 24000, 19000, 15000, 18000, 21000, 14000, 12000, 31000]}

<h4>Question 2</h4>

<p>A. Unique departments...</p>

In [28]:
#function for unique departments

def get_unique_department(df, column_name):
    unique_department = df[column_name].unique()
    return unique_department

unique_deparments= get_unique_department(df, 'department')
print(f"unique departments {unique_deparments}")

unique departments ['Sales' 'Finance' 'Marketing']

In [29]:
#count sales department
number_of_sales_department = df[df['department'] == 'Sales']['department'].count()
print(f"Sales department exists {number_of_sales_department} times")

Sales department exists 5 times

<p>B. Aggregation per state </p>

In [73]:
def aggregate_per_state(df, state, aggregation='sum'):
    aggregated_df = df.groupby(state).agg(aggregation).reset_index()
    return aggregated_df

aggregated_data = aggregate_per_state(df, "state", aggregation='sum')

aggregated_data

C:\Users\User\AppData\Local\Temp\ipykernel_5396\818824818.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  aggregated_df = df.groupby(state).agg(aggregation).reset_index()

       state  salary  age  bonus
0      Adama   82000   65  45000
1  Dire Dawa  266000  169  61000
2     Gondar  350000  173  83000
3     Jijiga  170000  114  41000

In [74]:
aggregated_data.columns

Index(['state', 'salary', 'age', 'bonus'], dtype='object')

In [56]:
# aggregated_data.dtypes

<p>i. The average salary in dre dewa</p>

In [63]:
# Average salary in Dire Dawa
dere_dewa_average_salary = aggregated_data.loc['Dire Dawa', 'salary'].mean()

print(f"Dere dewa average salary= {dere_dewa_average_salary}")

Dere dewa average salary= 266000.0

<p>ii. Total bonus in jiiga</p>

In [46]:
jijiga_total_bonus=aggregated_data.loc['Jijiga', 'bonus'].sum()

print(f"The total bonus in Jijiga state= {jijiga_total_bonus}")

The total bonus in Jijiga state= 41000

<p>iii. Minimum salary n Gondar</p>

In [47]:
gondar_minimum_salary=aggregated_data.loc['Gondar', 'salary'].min()

print(f"the minimum salary in Gondar state= {gondar_minimum_salary}")

the minimum salary in Gondar state= 350000

<p>iv. The state with maximum age of employee</p>

In [87]:
maximum_age=df['age'].max()
state_with_maximum_age_group=df[df['age'] ==maximum_age]
print(f"The state {state_with_maximum_age_group['state']}")

The state 7    Jijiga
Name: state, dtype: object

<p>C. Employees with age greater than 40</p>

In [94]:
#states_with age greater than or equal to 40
top_3_states_with_maximum_age=df[df['age'] >=40]


top_3_states_with_maximum_age=top_3_states_with_maximum_age.sort_values('age',ascending=False)
top_3_states_with_maximum_age.head(3)

  employee_name department      state  salary  age  bonus
7       Ashebir  Marketing     Jijiga   80000   65  18000
1        Mesfin      Sales  Dire Dawa   86000   56  20000
6        Kabede    Finance     Gondar   79000   53  15000

<p>D.  Creating dataframe summary</p>

In [117]:
grouped_df = df.groupby(['department', 'state'])

# Calculating the total salary, total employees, and average bonus per department and state
summary_df = grouped_df.agg({'salary': 'sum', 'department': 'count', 'bonus': 'mean'})
summary_df = summary_df.rename(columns={'salary': 'Total Salary',
                                        'department': 'Total Employees',
                                        'bonus': 'Average Bonus'})
summary_df = summary_df.reset_index()

summary_df

  department      state  Total Salary  Total Employees  Average Bonus
0    Finance  Dire Dawa         90000                2        15500.0
1    Finance     Gondar        178000                2        19500.0
2    Finance     Jijiga         90000                1        23000.0
3  Marketing     Gondar         91000                1        21000.0
4  Marketing     Jijiga         80000                1        18000.0
5      Sales      Adama         82000                2        22500.0
6      Sales  Dire Dawa        176000                2        15000.0
7      Sales     Gondar         81000                1        23000.0

<h4>Question 3</h4>

<p>A. Creating database</p>

In [ ]:

# Create a MySQL database connection
connection = pymysql.connect(host=host, user=user, password=password, database=database)

# Create a cursor object to execute SQL queries
cursor = connection.cursor()

In [ ]:
host=""
user=""
password=""
database=""
# Create a MySQL database connection
connection = mysql.connect(host=host, user=user, password=password, database=database)

cursor = connection.cursor()

create_table_query = '''
CREATE TABLE IF NOT EXISTS summary_table (
    state VARCHAR(255),
    department VARCHAR(255),
    total_salary FLOAT,
    total_employees INT,
    average_bonus FLOAT
);
'''

cursor.execute(create_table_query)

# Insert the data frame into the table
summary_df.to_sql(name='summary_table')
cursor.close()
connection.close()

<p>B. Visualization</p>

In [109]:
#importing the library
import matplotlib.pyplot as plt

In [141]:
total_salary_and_average_bonus=summary_df.groupby("state").agg({'Total Salary': 'sum', 'Average Bonus': 'sum'}.reset_index()

total_salary_and_average_bonus

       state  Total Salary  Average Bonus
0      Adama         82000        22500.0
1  Dire Dawa        266000        30500.0
2     Gondar        350000        63500.0
3     Jijiga        170000        41000.0

In [152]:
total_salary_and_average_bonus.dtypes

state             object
Total Salary       int64
Average Bonus    float64
dtype: object

In [154]:
tot_salary = total_salary_and_average_bonus.rename(columns={'Total Salary':'Total_Salary','Average Bonus':'Average_Bonus'})
tot_salary

       state  Total_Salary  Average_Bonus
0      Adama         82000        22500.0
1  Dire Dawa        266000        30500.0
2     Gondar        350000        63500.0
3     Jijiga        170000        41000.0

In [ ]:
ax =

In [153]:
# plot = plt.subplot()
# fig, ax=plot
# ax.bar(total_salary_and_average_bonus['state'],total_salary_and_average_bonus["Total Salary"])
# ax.set_title('total salary and bonus grouped by state')
# ax.set_xlable('states')
# ax.set_ylable('Total salary')

# plt.show()

In [150]:
employee_group_by_state=summary_df.groupby("state").agg({'Total Employees': 'sum'}).reset_index()

total_salary = employee_group_by_state['Total salary']
average_employees = employee_group_by_state['Total Employees']
departments = employee_group_by_state['department']

# Plotting the pie chart for total salary
ax.pie(total_salary, labels=departments, autopct='%1.1f%%', startangle=90)
ax.set_aspect('equal')
ax.set_title('Distribution of Total Salary by Department')
ax.show()

KeyError: 'Total salary'